clc;clear;
%第三部分第1题，常加速度法部分
I=21714*10^4;%mm^4
E=210000;%MPa
m1=6;%N/mm*sec^2, 1kg=1 N/m*sec^2=10^(-3) N/mm*sec^2
h=3000;%mm
k=8*E*I/h^3*[5 -2 0;-2 3 -1;0 -1 1];%N/mm
m=m1*[1 0 0;0 1 0;0 0 1/2];
% 振型矩阵
A=[1 1 1;2.1861 1 -0.6861;3.1861 -2 0.3139];
% 自振频率
wn=[37.61;81.09;119.8];
M=A'*m*A;
K=A'*k*A;
p=[10*10^3;15*10^3;20*10^3];
P=A'*p;
i=0:0.01:3;
% 第一振型方程求解
p1=P(1,1)*sin(2*pi*i);
K1=K(1,1);
M1=M(1,1);
[y11,v11,a11]=NewmarkMethod(1/2,1/4,p1,3,K1,M1,0,0.01);
% 第二振型方程求解
p2=P(2,1)*sin(2*pi*i);
K2=K(2,2);
M2=M(2,2);
[y12,v12,a12]=NewmarkMethod(1/2,1/4,p2,3,K2,M2,0,0.01);
% 第三振型方程求解
p3=P(3,1)*sin(2*pi*i);
K3=K(3,3);
M3=M(3,3);
[y13,v13,a13]=NewmarkMethod(1/2,1/4,p3,3,K3,M3,0,0.01);
    
% 振型矩阵
A=[1 1 1;2.1861 1 -0.6861;3.1861 -2 0.3139];

u11=A(1,1)*y11;%第一振型
u12=A(2,1)*y12;%第二振型
u13=A(3,1)*y13;%第三振型
u1=u11+u12+u13;%第一个质量的总反应

plot(i,u1)
xlabel('时间（s)');
ylabel('侧移（mm）');
title('底层质量振动曲线');
%以上为常加速法
%%
%第三部分第1题，wilson-theta法部分
I=21714*10^4;%mm^4
E=210000;%MPa
m1=6;%N/mm*sec^2, 1kg=1 N/m*sec^2=10^(-3) N/mm*sec^2
h=3000;%mm
k=8*E*I/h^3*[5 -2 0;-2 3 -1;0 -1 1];%N/mm
m=m1*[1 0 0;0 1 0;0 0 1/2];
% 振型矩阵
A=[1 1 1;2.1861 1 -0.6861;3.1861 -2 0.3139];
% 自振频率
wn=[37.61;81.09;119.8];
M=A'*m*A;
K=A'*k*A;
p=[10*10^3;15*10^3;20*10^3];
P=A'*p;
i=0:0.01:3;
% 第一振型方程求解
p1=P(1,1)*sin(2*pi*i);
K1=K(1,1);
M1=M(1,1);
[y11,v11,a11]=WilsonTheta(p1,3,K1,M1,0,0.01);
% 第二振型方程求解
p2=P(2,1)*sin(2*pi*i);
K2=K(2,2);
M2=M(2,2);
[y12,v12,a12]=WilsonTheta(p2,3,K2,M2,0,0.01);
% 第三振型方程求解
p3=P(3,1)*sin(2*pi*i);
K3=K(3,3);
M3=M(3,3);
[y13,v13,a13]=WilsonTheta(p2,3,K3,M3,0,0.01);
    
% 振型矩阵
A=[1 1 1;2.1861 1 -0.6861;3.1861 -2 0.3139];

u11=A(1,1)*y11;%第一振型
u12=A(2,1)*y12;%第二振型
u13=A(3,1)*y13;%第三振型
u1=u11+u12+u13;%第一个质量的总反应

hold on;
plot(i,u1,'r')

%以上为Wilson-theta法
%%
% clc;clear;
%第三部分第1题，理论解部分
I=21714*10^4;%mm^4
E=210000;%MPa
m1=6;%N/mm*sec^2, 1kg=1 N/m*sec^2=10^(-3) N/mm*sec^2
h=3000;%mm
k=8*E*I/h^3*[5 -2 0;-2 3 -1;0 -1 1];%N/mm
m=m1*[1 0 0;0 1 0;0 0 1/2];
% 振型矩阵
A=[1 1 1;2.1861 1 -0.6861;3.1861 -2 0.3139];
% 自振频率
wn=[37.61;81.09;119.8];
M=A'*m*A;
K=A'*k*A;
p=[10;15;20];
P=A'*p;

% 相对频率 w=2*pi/wn
w_c=2*pi./wn;
% 放大系数
D=1./(1-w_c.^2);

% 作图:第一个质量
t=0:0.01:3;
% 广义坐标
y1=-0.2*sin(37.61*t)+1.19*sin(2*pi*t);
y2=-0.072*sin(81.09*t)-0.093*sin(2*pi*t);
y3=0.0024*sin(119.8*t)+0.0458*sin(2*pi*t);
% 振型矩阵
A=[1 1 1;2.1861 1 -0.6861;3.1861 -2 0.3139];
v11=A(1,1)*y1;%第一振型
v12=A(2,1)*y2;%第二振型
v13=A(3,1)*y3;%第三振型
v1=v11+v12+v13;%第一个质量的总反应


hold on;
plot(t,v1,'g')
